/**
 * Created by Anatoliy on 23.10.2016.
 */
/**
Comparing:
Names Comparing (*). Задан List<String> names.
 Выполнить задачи (каждая задача - отдельный метод, работающий с исходным списком):
1. Отсортировать имена в алфавитном порядке.
2. Отсортировать имена в алфавитном порядке по убыванию.
3. Найти наименьшее имя в алфавитном порядке (использовать метод Collections.min(...)).
4. Отсортировать имена по количеству букв.
5. Отсортировать имена по количеству букв, а в группах, где количество букв одинаковое, - в алфавитном порядке по убыванию.
 */
package JavaOOP.Lesson7.HomeWork.Comparing.NamesComparing;