/**
 * Created by Anatoliy on 17.10.2016.
 */
/*
Человек просыпается и обнаруживает, что он находится в вагоне поезда.
Включается телевизор, и кукла с экрана говорит, что хочет поиграть в игру.
Поезд состоит из вагонов, которые образуют кольцо.
В каждом вагоне есть лампочка, которая случайным образом включена/выключена.
Человек может переходить в соседние вагоны, проверять и изменять состояние лампочек.
В каждом вагоне есть дверь. Чтобы выйти, нужно ввести код - количество вагонов.

Задание: определить количество вагонов в поезде.

Дан интерфейс возможных действий Train.

Задачи для программирования:

1. Написать программу с методом поиска количества вагонов:
public static int findLength(Train train)

2. Написать реализацию интерфейса Train.
 */
package JavaOOP.Lesson5.HomeWork;