/**
 * Created by Anatoliy on 30.10.2016.
 */
/*

Задание:
1. Написать реализацию стека Stack<E>:
1.1. С помощью динамического массива.
1.2. С помощью связного списка.
1.2. С использованием LinkedList.

2. Написать реализацию очереди Queue<E>:
2.1. С помощью динамического массива.
2.2. С помощью связного списка.
2.2. С использованием LinkedList.

3. Написать реализацию поезда Train (кольцевой двухсвязный список с элементом типа boolean)

Уточнения по поводу ДЗ:
1. Реализовать = implements.
2. На основе динамического массива: E[ ] elems (шаблон ArrayQueue<E>)
3. На основе связного списка: создать внутренний статический класс-оболочку Node<E> и реализовать логику односвязного/двусвязного списка (шаблон LinkedQueue<E>)
4. На основе LinkedList: делегировать обязанности объекту типа LinkedList (шаблон LinkedListQueue<E>)

 */
package JavaOOP.Lesson8.HomeWork;